example/twoD_detonation_6670/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  1.5                                   |
|   \  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * created with GraVentGen4.c * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(

   (   0   30.8   0.05) // vert. 0 start
   (   0   30.8   -0.05) // vert. 1 
   (   0  -30.8    0.05) // vert. 2 
   (   0  -30.8   -0.05) // vert. 3 
   (600  -30.8    0.05) // vert. 4 
   (600  -30.8   -0.05) // vert. 5 
   (600   30.8    0.05) // vert. 6 start
   (600   30.8   -0.05) // vert. 7 
);


blocks
(

    hex (   3    5    7    1    2    4    6    0)  (4000  256   1) simpleGrading (1 1 1) // block 0
);


edges // only required for curved edges
(
);

patches
(  // Normal vector has to point out of the domain;
   // (right hand rule in order of enumeration)
  wall wand
   (
     (0 6 7 1)//up
      (4 2 3 5)//down
   )

  patch right
   (
    (5 7 6 4)
   )
  wall left
   (
    (2 0 1 3)
   )
    empty frontAndBack
    (
      (2 4 6 0) // front
      (3 1 7 5) // back
     //(0 6 7 1)//up
      //(4 2 3 5)//down
    )
);

mergePatchPairs
(
);

// * * * * created with Vent2D * * * * * * * * * * * * * * * * * * * * * * * //

