example/twoD_detonation_6670/constant/CanteraTorchProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version          2.0;
    format           ascii;
    class            dictionary;
    location         "constant";
    object           CanteraTorchProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry            on;

CanteraMechanismFile "oran.yaml";

transportModel       "Mix";

odeCoeffs
{
    "relTol"         1e-6;
    "absTol"         1e-10;
}

inertSpecie          "AR";

splittingStrategy    off;

TorchSettings
{
    torch            off;
}

loadbalancing
{
    active           true;
    log              false;
    algorithm        allAverage;//headTail;
}


// ************************************************************************* //
