example/twoD_detonation_6670/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dfDynamicRefineFvMesh;

multiCritRefinementControls
{
    enableMultiCritRefinementControl  false;
}

dfDynamicRefineFvMeshCoeffs
{
    // How often to refine
    refineInterval  30; 

    // Field to be refinement on
    field           error;//normalisedGradrho;

    // Refine field in between lower..upper
    //lowerRefineLevel 0.0005;
    //upperRefineLevel 1;

    lowerRefineLevel 1e-2;
    upperRefineLevel 1e6;

    // If value < unrefineLevel unrefine
    //unrefineLevel   0.0005;
    unrefineLevel   1e-2;

    // Have slower than 2:1 refinement
    nBufferLayers   3;

    // Refine cells only up to maxRefinement levels
    maxRefinement   2;

    // Stop refinement if maxCells reached
    maxCells        100000000;

    // Flux field and corresponding velocity field. Fluxes on changed
    // faces get recalculated by interpolating the velocity. Use 'none'
    // on surfaceScalarFields that do not need to be reinterpolated.
    correctFluxes
    (
        (phiM none)
    (phiCorr none)
    (phiT none)
    (phi none)
    (rhoPhi none)
    (rhoUPhi none)
    (rhoEPhi none)
    (neg none)
    (pos none)
    (e_neg none)
    (e_pos none)
    (aphiv_pos none)
    (aphiv_neg none)
    (a_pos none)
    (a_neg none)
    (rPsi_pos none)
    (rPsi_neg none)
    (interpolate(rho) none)
    (p_pos none)
    (p_neg none)
    (HLL::SNei none)
    (HLL::SOwn none)
    (HLL::SStar none)
    (HLL::pStar none)
    (HLLC::SNei none)
    (HLLC::SOwn none)
    (HLLC::SStar none)
    (HLLC::pStar none)
    (HLLCP::SNei none)
    (HLLCP::SOwn none)
    (HLLCP::SStar none)
    (HLLCP::pStar none)
    (fluxScheme::own none)
    (amaxSf none)
    (HLL::UvNei none)
    (HLL::UvOwn none)
    (HLLC::UvNei none)
    (HLLC::UvOwn none)
    (HLLCP::UvNei none)
    (HLLCP::UvOwn none)
    (am_ref none)
    (rho_pos none)
    (cSf_neg none)
    (cSf_pos none)
    (HLLC::phip none)
    (HLLCP::phip none)
    (ap_ref none)
    (aSf_ref none)
    (phiv_pos none)
    (phiv_neg none)
    (rho_neg none)
    (fluxScheme::nei none)
    (HLL::pStarNei none)
    (HLL::pStarOwn none)
    (HLLC::pStarNei none)
    (HLLC::pStarOwn none)
    (HLLCP::pStarNei none)
    (HLLCP::pStarOwn none)
    (Kurganov::aNei none)
    (Kurganov::aOwn none)
    (Kurganov::aSf none)
    (Kurganov::aPhivOwn none)
    (Kurganov::aPhivNei none)
    (AUSMPlus::phi none)
    (AUSMPlusUp::phi none)
    );

    // Write the refinement level as a volScalarField
    dumpLevel       true;
}


// ************************************************************************* //
