example/twoD_detonation_6670/0_orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  combo                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    left
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wand
    {
        type            slip;
        //value           uniform (0 0 0);
    }
    right
    {
        type            zeroGradient;
    }
        frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
