example/twoD_detonation_6670/0_orig/AR
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+-hyStrath                       |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      AR;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.886;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    left
    {
        type            zeroGradient;
    }
    wand
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
